# pymysql

In [ ]:
import pymysql

In [6]:
# MySQL ÏÑúÎ≤ÑÏóê Ïó∞Í≤∞
con = pymysql.connect(host='localhost', user='root', password='1234',  db='my_db',
 charset='utf8') # ÌïúÍ∏ÄÏ≤òÎ¶¨ (charset = 'utf8‚Äô)
# Ïª§ÏÑú ÏÉùÏÑ±
cursor = con.cursor()

In [7]:
con

In [10]:
sql_query = """
SELECT 
ENAME
, SAL
, JOB
FROM emp;
"""
cursor.execute(sql_query)
result = cursor.fetchall()
result

(('SMITH', Decimal('800.00'), 'CLERK'),
 ('ALLEN', Decimal('1600.00'), 'SALESMAN'),
 ('WARD', Decimal('1250.00'), 'SALESMAN'),
 ('JONES', Decimal('2975.00'), 'MANAGER'),
 ('MARTIN', Decimal('1250.00'), 'SALESMAN'),
 ('BLAKE', Decimal('2850.00'), 'MANAGER'),
 ('CLARK', Decimal('2450.00'), 'MANAGER'),
 ('SCOTT', Decimal('3000.00'), 'ANALYST'),
 ('KING', Decimal('5000.00'), 'PRESIDENT'),
 ('TURNER', Decimal('1500.00'), 'SALESMAN'),
 ('ADAMS', Decimal('1100.00'), 'CLERK'),
 ('JAMES', Decimal('950.00'), 'CLERK'),
 ('FORD', Decimal('3000.00'), 'ANALYST'),
 ('MILLER', Decimal('1300.00'), 'CLERK'))

In [15]:
import pandas as pd

pd.DataFrame(result)

         0        1          2
0    SMITH   800.00      CLERK
1    ALLEN  1600.00   SALESMAN
2     WARD  1250.00   SALESMAN
3    JONES  2975.00    MANAGER
4   MARTIN  1250.00   SALESMAN
5    BLAKE  2850.00    MANAGER
6    CLARK  2450.00    MANAGER
7    SCOTT  3000.00    ANALYST
8     KING  5000.00  PRESIDENT
9   TURNER  1500.00   SALESMAN
10   ADAMS  1100.00      CLERK
11   JAMES   950.00      CLERK
12    FORD  3000.00    ANALYST
13  MILLER  1300.00      CLERK

In [16]:
# ÏøºÎ¶¨ Ïã§Ìñâ ÏòàÏãú
sql_query = """SELECT e.ename AS ÏÇ¨ÏõêÏù¥Î¶Ñ, 
            d.dname AS ÏÜåÏÜçÎ∂ÄÏÑúÏù¥Î¶Ñ, 
            e.sal AS Í∏âÏó¨, 
            e.job AS ÏßÅÎ¨¥
        FROM emp e
        JOIN dept d ON e.deptno = d.deptno;"""

cursor.execute(sql_query)
# ÏøºÎ¶¨ Í≤∞Í≥º Í∞ÄÏ†∏Ïò§Í∏∞
result_2 = cursor.fetchall()
# Í≤∞Í≥º Ï∂úÎ†•
for row in result_2:
 print(row)

('CLARK', 'ACCOUNTING', Decimal('2450.00'), 'MANAGER')
('KING', 'ACCOUNTING', Decimal('5000.00'), 'PRESIDENT')
('MILLER', 'ACCOUNTING', Decimal('1300.00'), 'CLERK')
('SMITH', 'RESEARCH', Decimal('800.00'), 'CLERK')
('JONES', 'RESEARCH', Decimal('2975.00'), 'MANAGER')
('SCOTT', 'RESEARCH', Decimal('3000.00'), 'ANALYST')
('ADAMS', 'RESEARCH', Decimal('1100.00'), 'CLERK')
('FORD', 'RESEARCH', Decimal('3000.00'), 'ANALYST')
('ALLEN', 'SALES', Decimal('1600.00'), 'SALESMAN')
('WARD', 'SALES', Decimal('1250.00'), 'SALESMAN')
('MARTIN', 'SALES', Decimal('1250.00'), 'SALESMAN')
('BLAKE', 'SALES', Decimal('2850.00'), 'MANAGER')
('TURNER', 'SALES', Decimal('1500.00'), 'SALESMAN')
('JAMES', 'SALES', Decimal('950.00'), 'CLERK')

In [18]:
pd.DataFrame(result_2)

         0           1        2          3
0    CLARK  ACCOUNTING  2450.00    MANAGER
1     KING  ACCOUNTING  5000.00  PRESIDENT
2   MILLER  ACCOUNTING  1300.00      CLERK
3    SMITH    RESEARCH   800.00      CLERK
4    JONES    RESEARCH  2975.00    MANAGER
5    SCOTT    RESEARCH  3000.00    ANALYST
6    ADAMS    RESEARCH  1100.00      CLERK
7     FORD    RESEARCH  3000.00    ANALYST
8    ALLEN       SALES  1600.00   SALESMAN
9     WARD       SALES  1250.00   SALESMAN
10  MARTIN       SALES  1250.00   SALESMAN
11   BLAKE       SALES  2850.00    MANAGER
12  TURNER       SALES  1500.00   SALESMAN
13   JAMES       SALES   950.00      CLERK

In [19]:
# Ïó∞Í≤∞Í≥º Ïª§ÏÑú Îã´Í∏∞
cursor.close()
con.close()

---

# mysqlclient

In [21]:
import MySQLdb

In [22]:
# MySQL ÏÑúÎ≤ÑÏóê Ïó∞Í≤∞
db_config = {
'host' :'localhost',  # Ìò∏Ïä§Ìä∏ Ïù¥Î¶Ñ
'user' : 'root', # MySQL ÏÇ¨Ïö©Ïûê Ïù¥Î¶Ñ
'passwd' : '1234', # MySQL ÏÇ¨Ïö©Ïûê ÎπÑÎ∞ÄÎ≤àÌò∏
'db' : 'my_db', # Ïó∞Í≤∞Ìï† Îç∞Ïù¥ÌÑ∞Î≤†Ïù¥Ïä§ Ïù¥Î¶Ñ
'charset' : 'utf8'
}

In [23]:
try:
    conn = MySQLdb.connect(**db_config) # Ïª§ÏÑú ÏÉùÏÑ±
    cursor = conn.cursor() # ÏøºÎ¶¨ Ïã§Ìñâ ÏòàÏãú
    sql_query = "SELECT * FROM dept"
    cursor.execute(sql_query) # ÏøºÎ¶¨ Í≤∞Í≥º Í∞ÄÏ†∏Ïò§Í∏∞
    result = cursor.fetchall() # Í≤∞Í≥º Ï∂úÎ†•
    for row in result:
        print(row)
except MySQLdb.Error as e:
    print(f"Error: {e}")
finally: # Ïó∞Í≤∞Í≥º Ïª§ÏÑú Îã´Í∏∞
    cursor.close()
    conn.close()

(10, 'ACCOUNTING', 'NEW YORK')
(20, 'RESEARCH', 'DALLAS')
(30, 'SALES', 'CHICAGO')
(40, 'OPERATIONS', 'BOSTON')

---

# SQLAlchemy

### Ïó∞Í≤∞ ÌôïÏù∏

In [24]:
from sqlalchemy import create_engine
import pandas as pd

In [25]:
engine = create_engine("mysql+pymysql://root:1234@localhost/my_db")
engine

Engine(mysql+pymysql://root:***@localhost/my_db)

In [26]:
df = pd.read_sql("SHOW TABLES IN my_db;", engine)
df.head()

  Tables_in_my_db
0            dept
1             emp
2        salgrade

In [29]:
print(df)

  Tables_in_my_db
0            dept
1             emp
2        salgrade

In [30]:
tables = pd.read_sql("SELECT * FROM dept", engine)
tables.head()

   DEPTNO       DNAME       LOC
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

### products Î™®Îç∏ÏùÑ Ï†ïÏùòÌïòÍ≥† Ïó∞Í≤∞

In [33]:
from sqlalchemy import create_engine, Column, Integer, String
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker

# ORM Í∏∞Î≥∏ ÌÅ¥ÎûòÏä§ ÏÉùÏÑ±
Base = declarative_base()

C:\Users\Admin\AppData\Local\Temp\ipykernel_18376\52000807.py:6: MovedIn20Warning: The ``declarative_base()`` function is now available as sqlalchemy.orm.declarative_base(). (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  Base = declarative_base()

In [34]:
# products ÌÖåÏù¥Î∏î Ï†ïÏùò
class Product(Base):
    __tablename__ = 'products_1'

    id = Column(Integer, primary_key=True, autoincrement=True)
    name = Column(String(100), nullable=False)
    price = Column(Integer, nullable=False)
    stock = Column(Integer, nullable=False)

    def __repr__(self):
        return f"<Product(id={self.id}, name='{self.name}', price={self.price}, stock={self.stock})>"

In [36]:
# ÌÖåÏù¥Î∏î ÏÉùÏÑ±
Base.metadata.create_all(engine)

### Session ÎßåÎì§Í∏∞

In [37]:
Session = sessionmaker(bind=engine)
session = Session()

### SQLÏóÜÏù¥ ÎÑ£Í∏∞

In [38]:
def add_product(name, price, stock):
    new_product = Product(name=name, price=price, stock=stock)
    session.add(new_product)
    session.commit() # Ïª§Î∞ãÌï¥Ïïº Îì§Ïñ¥Í∞ÑÎã§
    print(f"üÜï '{name}' ÏÉÅÌíàÏù¥ Îì±Î°ùÎêòÏóàÏäµÎãàÎã§!")


add_product("Î°§Î¶¨Ìåù", 500, 10)
add_product("Ìï´Ï¥àÏΩî", 2000, 10)

üÜï 'Î°§Î¶¨Ìåù' ÏÉÅÌíàÏù¥ Îì±Î°ùÎêòÏóàÏäµÎãàÎã§!
üÜï 'Ìï´Ï¥àÏΩî' ÏÉÅÌíàÏù¥ Îì±Î°ùÎêòÏóàÏäµÎãàÎã§!

In [48]:
add_product('ÍπÄÎ∞•', 2000, 10)

üÜï 'ÍπÄÎ∞•' ÏÉÅÌíàÏù¥ Îì±Î°ùÎêòÏóàÏäµÎãàÎã§!

### ÏÉÅÌíàÏ°∞Ìöå

In [49]:
def list_products():
    products = session.query(Product).all()
    for p in products:
        print(p)

list_products()

<Product(id=1, name='Î°§Î¶¨Ìåù', price=500, stock=10)>
<Product(id=2, name='Ìï´Ï¥àÏΩî', price=3000, stock=10)>
<Product(id=3, name='ÍπÄÎ∞•', price=2000, stock=10)>

### UPDATE: Í∞ÄÍ≤© ÏàòÏ†ï

In [40]:
def update_price(product_id, new_price):
    product = session.query(Product).get(product_id)
    if product:
        product.price = new_price
        session.commit()
        print(f"üí∏ {product.name}Ïùò Í∞ÄÍ≤©Ïù¥ {new_price}ÏõêÏúºÎ°ú Î≥ÄÍ≤ΩÎêòÏóàÏäµÎãàÎã§.")
    else:
        print("‚ùå Ìï¥Îãπ ÏÉÅÌíàÏù¥ Ï°¥Ïû¨ÌïòÏßÄ ÏïäÏäµÎãàÎã§.")

update_price(2, 3000)

üí∏ Ìï´Ï¥àÏΩîÏùò Í∞ÄÍ≤©Ïù¥ 3000ÏõêÏúºÎ°ú Î≥ÄÍ≤ΩÎêòÏóàÏäµÎãàÎã§.

C:\Users\Admin\AppData\Local\Temp\ipykernel_18376\4289321564.py:2: LegacyAPIWarning: The Query.get() method is considered legacy as of the 1.x series of SQLAlchemy and becomes a legacy construct in 2.0. The method is now available as Session.get() (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  product = session.query(Product).get(product_id)

In [ ]:
update_price(4, 2000)

‚ùå Ìï¥Îãπ ÏÉÅÌíàÏù¥ Ï°¥Ïû¨ÌïòÏßÄ ÏïäÏäµÎãàÎã§.

C:\Users\Admin\AppData\Local\Temp\ipykernel_18376\4289321564.py:2: LegacyAPIWarning: The Query.get() method is considered legacy as of the 1.x series of SQLAlchemy and becomes a legacy construct in 2.0. The method is now available as Session.get() (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  product = session.query(Product).get(product_id)

### DELETE: ÏÉÅÌíà ÏÇ≠Ï†ú

In [50]:
def delete_product(product_id):
    product = session.query(Product).get(product_id)
    if product:
        session.delete(product)
        session.commit()
        print(f"üóëÔ∏è '{product.name}' ÏÉÅÌíàÏù¥ ÏÇ≠Ï†úÎêòÏóàÏäµÎãàÎã§.")
    else:
        print("‚ùå Ìï¥Îãπ ÏÉÅÌíàÏù¥ Ï°¥Ïû¨ÌïòÏßÄ ÏïäÏäµÎãàÎã§.")
        
delete_product(3)

üóëÔ∏è 'ÍπÄÎ∞•' ÏÉÅÌíàÏù¥ ÏÇ≠Ï†úÎêòÏóàÏäµÎãàÎã§.

C:\Users\Admin\AppData\Local\Temp\ipykernel_18376\652162444.py:2: LegacyAPIWarning: The Query.get() method is considered legacy as of the 1.x series of SQLAlchemy and becomes a legacy construct in 2.0. The method is now available as Session.get() (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  product = session.query(Product).get(product_id)

### ÏÑ∏ÏÖòÏùò Î∞òÎÇ©

In [51]:
try:
    # ÏûëÏóÖ
    product = session.query(Product).get(1)
    product.price += 500
    session.commit()
except Exception as e:
    session.rollback()
    print("ÏòàÏô∏ Î∞úÏÉù, Î°§Î∞±:", e)
finally:
    session.close()
    print("ÏÑ∏ÏÖò Ï¢ÖÎ£å")

ÏÑ∏ÏÖò Ï¢ÖÎ£å

C:\Users\Admin\AppData\Local\Temp\ipykernel_18376\1734247740.py:3: LegacyAPIWarning: The Query.get() method is considered legacy as of the 1.x series of SQLAlchemy and becomes a legacy construct in 2.0. The method is now available as Session.get() (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  product = session.query(Product).get(1)